In [10]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as pp
%matplotlib inline
import requests
import io

In [12]:
user = "sashvatsai" ; passwd = "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"
resp = requests.get(url, auth=(user, passwd))
url = "https://raw.githubusercontent.com/sashvatsai/google_colab_notebooks/main/Planets.csv"
planets = pd.read_csv(io.StringIO(resp.content.decode('utf-8')))

In [13]:
planets.head()

    Planet   Mass Diameter  ...  MagneticField  FirstVisited FirstMission
0  MERCURY  0.330     4879  ...            Yes    1974-03-29   Mariner 10
1    VENUS  4.870   12,104  ...             No    1962-08-27    Mariner 2
2    EARTH  5.970   12,756  ...            Yes           NaN          NaN
3     MOON  0.073     3475  ...             No    1959-09-12       Luna 2
4     MARS  0.642     6792  ...             No    1965-07-15    Mariner 4

[5 rows x 14 columns]